#ifndef __UEFI_MIN_H__
#define __UEFI_MIN_H__

#ifndef __clang__
#error This file is only for use with the clang compiler
#endif

#ifdef __cplusplus
extern "C" {
#endif

/*************************************
 * TYPES
*************************************/
#if defined(__x86_64__)
typedef unsigned long long UINT64;
typedef long long INT64;
typedef unsigned int UINT32;
typedef int INT32;
typedef unsigned short UINT16;
typedef unsigned short CHAR16;
typedef short INT16;
typedef unsigned char BOOLEAN;
typedef unsigned char UINT8;
typedef char CHAR8;
typedef signed char INT8;
typedef UINT64 UINTN;
typedef INT64 INTN;
typedef INT64 INTMAX;
#define MAX_BIT (1ull<63)
#elif defined(__i386__)
typedef unsigned long long UINT64;
typedef long long INT64;
typedef unsigned int UINT32;
typedef int INT32;
typedef unsigned short UINT16;
typedef unsigned short CHAR16;
typedef short INT16;
typedef unsigned char BOOLEAN;
typedef unsigned char UINT8;
typedef char CHAR8;
typedef signed char INT8;
typedef UINT32 UINTN;
typedef INT32 INTN;
typedef INT64 INTMAX;
#define MAX_BIT (1ul<31)
#elif defined(__aarch64__)
typedef unsigned long long UINT64;
typedef long long INT64;
typedef unsigned int UINT32;
typedef int INT32;
typedef unsigned short UINT16;
typedef unsigned short CHAR16;
typedef short INT16;
typedef unsigned char BOOLEAN;
typedef unsigned char UINT8;
typedef char CHAR8;
typedef signed char INT8;
typedef UINT64 UINTN;
typedef INT64 INTN;
typedef INT64 INTMAX;
#define MAX_BIT (1ull<63)
#else 
#error Architecture is not supported
#endif

/*************************************
 * LIMITS
*************************************/
#define INT8_MAX    (0x7F)
#define UINT8_MAX   (0xFF)
#define INT16_MAX   (0x7FFF)
#define UINT16_MAX  (0xFFFF)
#define INT32_MAX   (0x7FFFFFFF)
#define UINT32_MAX  (0xFFFFFFFF)
#define INT64_MAX   (0x7FFFFFFFFFFFFFFFULL)
#define UINT64_MAX  (0xFFFFFFFFFFFFFFFFULL)

#if defined(__x86_64__) || defined(__aarch64__)
#define INT_MAX   (0x7FFFFFFFFFFFFFFFULL)
#define UINT_MAX  (0xFFFFFFFFFFFFFFFFULL)
#elif defined(__i386__)
#define INT_MAX   (0x7FFFFFFFUL)
#define UINT_MAX  (0xFFFFFFFFUL)
#endif

#define INT8_MIN   (( -127) - 1)
#define INT16_MIN  (( -32767) - 1)
#define INT32_MIN  (( -2147483647) - 1)
#define INT64_MIN  (( -9223372036854775807LL) - 1)

#define SIZE_MAX (0xFFFFFFFF)
#define LONG_MAX (0x7FFFFFFF)
#define CHAR_BIT 8

/*************************************
 * VERIFICATION
*************************************/
_Static_assert(sizeof(BOOLEAN)  == 1, "Size check for 'BOOLEAN' failed.");
_Static_assert(sizeof(INT8)     == 1, "Size check for 'INT8' failed.");
_Static_assert(sizeof(UINT8)    == 1, "Size check for 'UINT8' failed.");
_Static_assert(sizeof(INT16)    == 2, "Size check for 'INT16' failed.");
_Static_assert(sizeof(UINT16)   == 2, "Size check for 'UINT16' failed.");
_Static_assert(sizeof(INT32)    == 4, "Size check for 'INT32' failed.");
_Static_assert(sizeof(UINT32)   == 4, "Size check for 'UINT32' failed.");
_Static_assert(sizeof(INT64)    == 8, "Size check for 'INT64' failed.");
_Static_assert(sizeof(UINT64)   == 8, "Size check for 'UINT64' failed.");

/*************************************
 * EFI TYPES
*************************************/
typedef UINTN EFI_TPL;
typedef UINTN EFI_STATUS;
typedef void VOID;
typedef VOID* EFI_HANDLE;
typedef VOID* EFI_EVENT;
typedef UINT64 EFI_PHYSICAL_ADDRESS;
typedef UINT64 EFI_VIRTUAL_ADDRESS;

#define IN
#define OUT
#define OPTIONAL
#define EFIAPI
#define CONST const

typedef struct {
    UINT64 Signature;
    UINT32 Revision;
    UINT32 HeaderSize;
    UINT32 CRC32;
    UINT32 Reserved;
} EFI_TABLE_HEADER;

typedef struct {
    UINT32 Data1;
    UINT16 Data2;
    UINT16 Data3;
    UINT8 Data4[8];
} EFI_GUID;

typedef struct _EFI_SYSTEM_TABLE EFI_SYSTEM_TABLE;
typedef struct _EFI_RUNTIME_SERVICES EFI_RUNTIME_SERVICES;
typedef struct _EFI_BOOT_SERVICES EFI_BOOT_SERVICES;
typedef struct _EFI_CONFIGURATION_TABLE EFI_CONFIGURATION_TABLE;

typedef struct _EFI_SIMPLE_TEXT_INPUT_PROTOCOL EFI_SIMPLE_TEXT_INPUT_PROTOCOL;
